# CondenserWaterLoopId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WaterLoopData..::..CondenserWaterLoopId Property
WaterLoopData Class See Also
---
The water loop element id for the water cooled chiller.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public ElementId CondenserWaterLoopId { get; set; }
```

Visual Basic
---
```text
Public Property CondenserWaterLoopId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ CondenserWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace